from data import AppleMaps, Course, Geo, School

品学楼地图 = AppleMaps("UESTC.ics")
立人楼A = Geo("电子科技大学清水河校区立人楼A区", 30.749454, 103.932191)
立人楼B = Geo("电子科技大学清水河校区立人楼A区", 30.748903, 103.931567)
# 定位信息的设置请参考 README.md

school = School(
    duration=45, # 每节课时间为 45 分钟
    timetable=[
        (8, 30), # 上午第一节课时间为 8:30 至 9:15
        (9, 20),
        (10, 20),
        (11, 10),
        (14, 30), # 下午第一节课时间为下午 2:30 至 3:15
        (15, 20),
        (16, 20),
        (17, 10),
        (19, 30),
        (20, 20),
        (21, 10)
    ],
    start=(2023, 8, 28), # 2023 年 8 月 28 日是开学第一周星期一
    courses=[
        Course("最优化理论与应用", "张三", "品学楼B107", 品学楼地图["品学楼B"], 1, Course.week(1, 13), [3, 4]),
            # 张三老师的「最优化理论与应用」会在第 1 至 13 周的星期一第 3-4 节在 品学楼B107 教室上课
        Course("新时代中国特色社会主义理论与实践", "李四", "立人楼B417", 立人楼B, 6, Course.week(1, 9) + [11] , [7, 8]),
            # 李四老师的「新时代中国特色社会主义理论与实践」会在第 1 至 9 周和第 11 周的的星期六第 7-8 节在 立人楼B417 教室上课
        Course("雷达与电子对抗系统", "王五", "立人楼A417", 立人楼A, 2, Course.week(1, 9), Course.week(9, 11)),
            # 王五老师的「雷达与电子对抗系统」会在第 1 至 9 周的星期二第 9-11 节在 立人楼A417 教室上课
        Course("信号检测与估计", "赵六", "品学楼C411", 品学楼地图["品学楼C"], 4, Course.odd_week(1, 11), [5, 6]),
            # 赵六老师的「信号检测与估计」会在第 1 至 11 的奇数周的星期四第 5-6 节在 品学楼C411 教室上课
    ]
)

with open("课表.ics", "w") as w:
    w.write(school.generate())
